tap "fluxcd/tap"
tap "gardener/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "stackitcloud/tap"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Tool for interacting with remote images and registries
brew "crane"
# Tool for exploring each layer in a docker image
brew "dive"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Kubernetes Native Policy Management
brew "kyverno"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Rsync for cloud storage
brew "rclone"
# Scans and monitors projects for security vulnerabilities
brew "snyk-cli"
# Launcher to analyze a project with SonarQube
brew "sonar-scanner"
# Kubernetes component that generates reports on cluster conformance
brew "sonobuoy"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Flux CLI
brew "fluxcd/tap/flux"
# Flux CLI
brew "fluxcd/tap/flux@2.2", link: false
# Gardenlogin
brew "gardener/tap/gardenlogin"
# Gardenctl-v2
brew "gardener/tap/gardenctl-v2"
# Terraform
brew "hashicorp/tap/terraform"
# Vault
brew "hashicorp/tap/vault"
# A command-line interface to manage STACKIT resources.
# This CLI is in a beta state. More services and functionality will be supported soon.
brew "stackitcloud/tap/stackit"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Web browser focusing on privacy
cask "brave-browser"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Go (golang) IDE
cask "goland"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Clipboard manager
cask "maccy"
# Open-source, low-latency, high quality voice chat software for gaming
cask "mumble"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Music streaming service
cask "spotify"
